app/helpers/photos_helper.rb

SELECT `photos`.* FROM `photos` WHERE `photos`.`flickr_id` = 'photo.id'
---
  def photo_in_gallery?(id)
    !Photo.where(flickr_id: id).blank?