app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO `albums` (`title`, `created_at`, `updated_at`) VALUES ('dsadsada', '2020-04-24 09:38:03.321184', '2020-04-24 09:38:03.321184')