app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)
    if @photo.save
---
INSERT INTO `photos` (`farm`, `server`, `flickr_id`, `secret`, `created_at`, `updated_at`) VALUES (66, 65535, '49807213397', '9c2a02a10d', '2020-04-24 06:15:49.139475', '2020-04-24 06:15:49.139475')

  def favorite
    @photos = Photo.all
---
SELECT `photos`.* FROM `photos`

  def destroy
    Photo.find(params[:id]).destroy
---
DELETE FROM `photos` WHERE `photos`.`id` = 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = NULL LIMIT 1