app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('example@example.com', '$2a$10$7B4.CxqBgKyp7QSSO62va.WHL4lOYct8C15RNrMTsLW4J94B75ZT2', 'DBvABtWqHmZZ2ffTTqMm', '2020-04-22 16:39:29.953083', '2020-04-22 16:39:29.953083')
---
  def create
    @user = User.new(user_params)
    if @user.save